<template>
    <div class="container">
        <div class="posts" v-for="post, index in posts" :key="index">
            <Post :post='post' />
        </div>
    </div>
</template>

<script>
import Post from '@/components/Post';
export default {
    components: {
        Post
    },

    data() {
        return {
            posts: [
                {
                    title: '«Гордость и предубеждение»',
                    author: 'Джейн Остин',
                    description: '«Гордость и предубеждение» – самый популярный женский роман в мире, провозглашенный интернет-пользователями Великобритании одной из лучших книг всех времен и народов. Он был написан Джейн Остен в 1796-1797 годах и до сих пор не утратил своей популярности. Мистер Дарси – главный герой романа – стал для многих читательниц эталоном мужчины, благородный аристократ, который закрывает глаза на сословные предрассудки и женится по любви на женщине, стоящей гораздо ниже его по положению. На Элизабет Беннет, гордой, неприступной девушке, умной, начитанной и глубоко чувствующей. Несколько экранизаций, два сериала и армия поклонников по всему миру навеки вписали роман «Гордость и предубеждение» в летопись лучших историй о любви, побеждающей любые преграды.',
                    images: [
                        require('@/assets/icons/books/austen1.jpeg'),
                        require('@/assets/icons/books/austen2.jpeg')

                    ]
                },
                {
                    title: 'Портрет Дориана Грэя',
                    author: 'Оскар Уайльд',
                    description: '"Портрет Дориана Грея" — самое знаменитое произведение Оскара Уайльда, единственный его роман, вызвавший в свое время шквал негативных оценок и тем не менее имевший невероятный успех. Главный герой романа, красавец Дориан, — фигура двойственная, неоднозначная. Тонкий эстет и романтик становится безжалостным преступником. Попытка сохранить свою необычайную красоту и молодость оборачивается провалом. Вместо героя стареет его портрет — но это не может продолжаться вечно, и смерть Дориана расставляет все по своим местам. Роман Оскара Уайльда продолжает быть очень актуальным и сегодня — разве погоня за вечной молодостью порой не оборачивается потерей своего истинного лица?',
                    images: [
                        require('@/assets/icons/books/oskar1.jpeg')

                    ]
                },
                {
                    title: 'Преступление и наказание',
                    author: 'Достоевский Федор Михайлович',
                    description: '"Преступление и наказание" (1866) — одно из самых значительных произведений в истории мировой литературы. Это и глубокий философский роман, и тонкая психологическая драма, и захватывающий детектив, и величественная картина мрачного города, в недрах которого герои грешат и ищут прощения, жертвуют собой и отрекаются от себя ради ближних и находят успокоение в смирении, покаянии, вере. Главный герой романа Родион Раскольников решается на убийство, чтобы доказать себе и миру, что он не "тварь дрожащая", а "право имеет". Главным предметом исследования писателя становится процесс превращения добропорядочного, умного и доброго юноши в убийцу, а также то, как совершивший преступление Раскольников может искупить свою вину.',
                    images: [
                        require('@/assets/icons/books/nakazanie1.jpeg')
                    ]
                },

            ]
        }
    }
}
</script>

<style scoped>
    .container {
        display: flex;
        justify-content: center;
        align-items: center;
        flex-direction: column;
    }
</style>
