<template>
    <div class="container">
        <div class="filters">
            <Filters />
        </div>
        <div class="all-posts">
            <div class="posts" v-for="post, index in posts" :key="index">
                <Post :post='post' />
            </div>
        </div>
    </div>
</template>

<script>
import Post from '@/components/Post';
import Filters from '@/components/filters/Filters';
export default {
    components: {
        Post,
        Filters
    },
    data() {
        return {
            posts: [
                {
                    title: '«Гордость и предубеждение»',
                    author: 'Джейн Остен',
                    genre: 'Художественная литература',
                    description: '«Гордость и предубеждение» – самый популярный женский роман в мире, провозглашенный интернет-пользователями Великобритании одной из лучших книг всех времен и народов. Он был написан Джейн Остен в 1796-1797 годах и до сих пор не утратил своей популярности. Мистер Дарси – главный герой романа – стал для многих читательниц эталоном мужчины, благородный аристократ, который закрывает глаза на сословные предрассудки и женится по любви на женщине, стоящей гораздо ниже его по положению. На Элизабет Беннет, гордой, неприступной девушке, умной, начитанной и глубоко чувствующей. Несколько экранизаций, два сериала и армия поклонников по всему миру навеки вписали роман «Гордость и предубеждение» в летопись лучших историй о любви, побеждающей любые преграды.',
                    images: [
                        require('@/assets/icons/books/austen1.jpeg'), 
                        require('@/assets/icons/books/austen2.jpeg')
                    ],
                    price: '350руб',
                },
                {
                    title: '«Портрет Дориана Грэя»',
                    author: 'Оскар Уайльд',
                    genre: 'Художественная литература',
                    description: '"Портрет Дориана Грея" — самое знаменитое произведение Оскара Уайльда, единственный его роман, вызвавший в свое время шквал негативных оценок и тем не менее имевший невероятный успех. Главный герой романа, красавец Дориан, — фигура двойственная, неоднозначная. Тонкий эстет и романтик становится безжалостным преступником. Попытка сохранить свою необычайную красоту и молодость оборачивается провалом. Вместо героя стареет его портрет — но это не может продолжаться вечно, и смерть Дориана расставляет все по своим местам. Роман Оскара Уайльда продолжает быть очень актуальным и сегодня — разве погоня за вечной молодостью порой не оборачивается потерей своего истинного лица?',
                    images: [
                        require('@/assets/icons/books/oskar1.jpeg'),
                        require('@/assets/icons/books/oskar2.jpeg')
                    ],
                    price: '350руб',
                },
                {
                    title: '«Преступление и наказание»',
                    author: 'Федор Достоевский',
                    genre: 'Художественная литература',
                    description: '"Преступление и наказание" (1866) — одно из самых значительных произведений в истории мировой литературы. Это и глубокий философский роман, и тонкая психологическая драма, и захватывающий детектив, и величественная картина мрачного города, в недрах которого герои грешат и ищут прощения, жертвуют собой и отрекаются от себя ради ближних и находят успокоение в смирении, покаянии, вере. Главный герой романа Родион Раскольников решается на убийство, чтобы доказать себе и миру, что он не "тварь дрожащая", а "право имеет". Главным предметом исследования писателя становится процесс превращения добропорядочного, умного и доброго юноши в убийцу, а также то, как совершивший преступление Раскольников может искупить свою вину.',
                    images: [
                        require('@/assets/icons/books/nakazanie1.jpeg'),
                        require('@/assets/icons/books/nakazanie2.jpeg')
                    ],
                    price: '350руб',
                },
                {
                    title: '«Сияние»',
                    author: 'Стивен Кинг',
                    genre: 'Мистика.Ужасы',
                    description: '…Проходят годы, десятилетия, но потрясающая история писателя Джека Торранса, его сынишки Дэнни, наделенного необычным даром, и поединка с темными силами, обитающими в роскошном отеле «Оверлук», по-прежнему завораживает и держит в неослабевающем напряжении читателей самого разного возраста…',
                    images: [
                        require('@/assets/icons/books/siyanie.jpeg'),
                        require('@/assets/icons/books/siyanie1.jpeg'),
                        require('@/assets/icons/books/siyanie2.jpeg'),
                    ],
                    price: '350руб',
                },
                 {
                    title: '«Дракула»',
                    author: 'Стокер Брэм',
                    genre: 'Мистика.Ужасы',
                    description: 'Десятки всевозможных экранизаций. Образ, растиражированный в мировой культуре, как, наверное, ни один другой. Роман, ставший основой всей «готической» субкультуры и краеугольным камнем различных направлений в фантастической литературе... О «Дракуле» Брэма Стокера можно говорить бесконечно, но лучше просто открыть бессмертный роман о зловещем и загадочном трансильванском графе-вампире и погрузиться в его причудливую, таинственную и завораживающую атмосферу.',
                    images: [
                        require('@/assets/icons/books/drakula1.jpeg'),
                        require('@/assets/icons/books/drakula2.jpeg'),
                    ],
                    price: '350руб',
                },
                 {
                    title: '«451° по Фаренгейту»',
                    author: 'Рэй Брэдбери',
                    genre: 'Научная фантастика',
                    description: '451° по Фаренгейту - температура, при которой воспламеняется и горит бумага. Философская антиутопия Брэдбери рисует беспросветную картину развития постиндустриального общества: это мир будущего, в котором все письменные издания безжалостно уничтожаются специальным отрядом пожарных, а хранение книг преследуется по закону, интерактивное телевидение успешно служит всеобщему оболваниванию, карательная психиатрия решительно разбирается с редкими инакомыслящими, а на охоту за неисправимыми диссидентами выходит электрический пес..',
                    images: [
                        require('@/assets/icons/books/far1.jpeg'),
                        require('@/assets/icons/books/far2.jpeg'),
                    ],
                    price: '350руб',
                },
                {
                    title: '«Загадка закрытого ящика»',
                    author: 'Вебб Холли',
                    genre: 'Книги для детей',
                    description: 'Конечно, никто не предложит Мейзи начать карьеру детектива с поиска похищенных бриллиантов (а хотелось бы!). Первое дело придется найти самой – например, помочь знакомому мальчику, которого обвинили в краже денег, пропавших из… закрытого на ключ ящика!',
                    images: [
                        require('@/assets/icons/books/meizi1.jpeg'),
                        require('@/assets/icons/books/meizi2.jpeg'),
                    ],
                    price: '350руб',
                },
                 {
                    title: '«Секрет еловых писем»',
                    author: 'Шойнеманн Фрауке',
                    genre: 'Книги для детей',
                    description: 'Жизнь кота-детектива не так-то легка. Вместо того чтобы наслаждаться безмятежным сном и отменными деликатесами, Уинстону приходится расследовать новое запутанное преступление. В этот раз случилось невероятное: одноклассницу его подруги Киры Эмилию похитили – и это в самый разгар репетиций школьного спектакля, в котором девочка играла главную роль! Теперь преступник требует выкуп! Детям и дворовым кошкам придётся объединиться, чтобы вывести злоумышленника на чистую воду. Но есть одна проблема… К Кире из России приехала бабушка, которая неустанно следит за внучкой и её котом. Под таким надзором соблюдать секретность ну о-о-очень не просто…',
                    images: [
                        require('@/assets/icons/books/cat1.jpeg'),
                        require('@/assets/icons/books/cat2.jpeg'),
                    ],
                    price: '350руб',
                },
                 {
                    title: '«Музыкальная поэтика»',
                    author: 'Игорь Стравинский',
                    genre: 'Искусство',
                    description: 'Книга представляет собой цикл лекций по музыкальной поэтике, прочитанных Игорем Стравинским в Гарвардском университете в 1939–1940 гг. Понятным даже неподготовленному читателю, живым и образным языком этот гениальный композитор рассказывает о тех фундаментальных элементах, которые формируют музыкальное творчество. Что же такое музыка? Откуда берется вдохновение и какие материалы использует творец в своей работе? Как нужно исполнять музыку? И какова судьба русского музыкального искусства?..',
                    images: [
                        require('@/assets/icons/books/music1.jpeg'),
                        require('@/assets/icons/books/music2.jpeg'),
                    ],
                    price: '350руб',
                },
                 {
                    title: '«Феномены мозга»',
                    author: 'Владимир Бехтерев',
                    genre: 'Психология',
                    description: 'В этот сборник вошли психологические и психиатрические работы В.М. Бехтерева, посвященные вопросам гипноза, внушения и психологии масс, телепатии. Он исследовал возникновение иллюзий и галлюцинаций, проанализировал, почему случаются эпидемии религиозного характера и от чего на телах истово верующих появляются стигматы, объяснил феномен таких лидеров, как Жанна д’Арк, Магомет, Петр Великий, Наполеон, и почему за ними шли толпы, зараженные «психическим микробом».',
                    images: [
                        require('@/assets/icons/books/fenomen1.jpeg'),
                        require('@/assets/icons/books/fenomen2.jpeg'),
                    ],
                    price: '350руб',
                },
                // {
                //     title: '',
                //     author: '',  
                //     genre: '',
                //     description: '',
                //     images: [

                //     ],
                //     price: '',
                // },
            ]
        }
    }
}
</script>

<style scoped>
.all-posts {
    display: flex;
    flex-flow: row wrap;
    justify-content: center;
    gap: 20px;
}
</style>

